# Homebrew Bundle - Essential development tools
# Run `brew bundle` to install everything

# Taps
tap "dart-lang/dart"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "peripheryapp/periphery"
tap "qmk/qmk"
tap "sass/sass"

# Programming Languages & Runtimes
brew "go"
brew "node"
brew "python@3.13"
brew "python@3.12"
brew "python@3.11"
brew "ruby"
brew "lua"
brew "dart-lang/dart/dart"

# Development Tools
brew "git"
brew "gh"                      # GitHub CLI
brew "jj"                      # Jujutsu version control
brew "neovim"
brew "tmux"
brew "fzf"
brew "ripgrep"
brew "fd"
brew "jq"
brew "yq"
brew "just"
brew "watchexec"

# Language Servers & Formatters
brew "gopls"
brew "gofumpt"
brew "goimports"
brew "delve"                   # Go debugger
brew "lua-language-server"
brew "helm-ls"
brew "marksman"                 # Markdown LSP
brew "stylua"
brew "swiftformat"
brew "swiftlint"
brew "black"
brew "isort"

# Swift/iOS Development
brew "xcodes"
brew "xcode-build-server"
brew "xcbeautify"
brew "mint"                    # Swift package manager
brew "swift-outdated"
brew "swift-protobuf"

# Infrastructure & DevOps
brew "ansible"
brew "azure-cli"
brew "kubernetes-cli"
brew "helm"
brew "buf"                     # Protocol buffers

# Keyboard Development (QMK)
brew "qmk/qmk/qmk"
brew "osx-cross/avr/avr-gcc@9"
brew "osx-cross/arm/arm-none-eabi-gcc@8"
brew "osx-cross/arm/arm-none-eabi-binutils"

# Utilities
brew "aria2"                   # Download manager
brew "curl"
brew "gnupg"
brew "pinentry-mac"
brew "coreutils"
brew "nvm"                     # Node version manager
brew "pipx"                    # Python app installer
brew "yarn"
brew "sshuttle"                # SSH-based VPN

# Document Processing
brew "pandoc"
brew "tectonic"                # LaTeX engine
brew "ghostscript"
brew "imagemagick"
brew "fontforge"
brew "guetzli"                 # JPEG optimizer
brew "zopfli"                  # Compression
brew "apngasm"                 # APNG assembler

# Databases
brew "mongodb/brew/mongodb-database-tools"
brew "mongosh"

# Ruby Development
brew "ruby-build"
brew "fastlane"

# Web Development
brew "hugo"
brew "sass/sass/sass"
brew "contentful-cli"

# macOS Apps (Casks)
cask "basictex"
cask "bettertouchtool"
cask "copilot-for-xcode"
cask "github"
cask "kitty"
cask "periphery"